# SQL Subqueries - Lab Assignment #2

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database ERD

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="img/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database `data2.sqlite` in the data folder.

In [1]:
# Your code here; import the necessary packages
import sqlite3
import pandas as pd

In [2]:
# Your code here; create the connection
conn = sqlite3.Connection("data/data2.sqlite")

## Write an Equivalent Query using a Subquery

The following query works using a `JOIN`. Rewrite it so that it uses a subquery instead.

```
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM customers
JOIN orders 
    USING(customerNumber)
WHERE orderDate = '2003-01-31'
;
```

In [16]:
# Your code here
pd.read_sql('''
SELECT
    customerNumber,
    contactLastName,
    contactFirstName
FROM
    customers
WHERE customerNumber IN
(
    SELECT
       customerNumber
    FROM
        orders
    WHERE
        orderDate = '2003-01-31'
)
    
''', conn)

   customerNumber contactLastName contactFirstName
0             141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [4]:
# Your code here
pd.read_sql('''
SELECT
    productName,
    SUM(quantityOrdered) as total_number_of_orders
FROM
    products
JOIN
    orderdetails
        USING(productCode)
GROUP BY
    productName
''', conn)

                             productName  total_number_of_orders
0    18th Century Vintage Horse Carriage                     907
1                  18th century schooner                    1011
2                 1900s Vintage Bi-Plane                     940
3                1900s Vintage Tri-Plane                    1009
4                      1903 Ford Model A                     883
..                                   ...                     ...
104                        The Mayflower                     898
105                       The Queen Mary                     896
106                The Schooner Bluenose                     934
107                          The Titanic                     952
108            The USS Constitution Ship                    1020

[109 rows x 2 columns]

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

### A quick note on the SQL  `SELECT DISTINCT` statement:

The `SELECT DISTINCT` statement is used to return only distinct values in the specified column. In other words, it removes the duplicate values in the column from the result set.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the unique values. If you apply the `DISTINCT` clause to a column that has `NULL`, the `DISTINCT` clause will keep only one NULL and eliminates the other. In other words, the DISTINCT clause treats all `NULL` “values” as the same value.

In [15]:
# Your code here
# Hint: because one of the tables we'll be joining has duplicate customer numbers, you should use DISTINCT
pd.read_sql('''
SELECT
    productName,
    COUNT(customerName) as customer_amount
FROM
    customers
JOIN
    orders
        USING(customerNumber)
JOIN
    orderdetails
        USING(orderNumber)
JOIN
    products
        USING(productCode)
GROUP BY
    productName
ORDER BY
    customer_amount ASC
''', conn)

                             productName  customer_amount
0                      1952 Citroen-15CV               24
1                  1957 Ford Thunderbird               24
2                     1911 Ford Town Car               25
3               1917 Grand Touring Sedan               25
4    1932 Alfa Romeo 8C2300 Spider Sport               25
..                                   ...              ...
104     Diamond T620 Semi-Skirted Tanker               28
105                   F/A 18 Hornet 1/72               28
106                           HMS Bounty               28
107                       P-51-D Mustang               28
108          1992 Ferrari 360 Spider red               53

[109 rows x 2 columns]

## Select the Employee Number, First Name, Last Name, City (of the office), and Office Code of the Employees Who Sold Products That Have Been Ordered by Fewer Than 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
# Your code here
pd.read_sql('''
SELECT
    DISTINCT(e.employeeNumber),
    e.firstName,
    e.lastName,
    o.city,
    o.officeCode
FROM 
    employees e
JOIN
    offices io
        USING(officeCode)
WHERE officeCode IN
(
    SELECT
        officeCode
    JOIN
        employees
            USING(officeCode)
    JOIN 
        customers
            USING(city)
    JOIN
        orders
            USING()
)

''', conn)

In [ ]:
SELECT
    e.employeeNumber,
    e.firstName,
    e.lastName,
    o.city,
    e.officeCode
FROM
    employees e
JOIN
    offices o
        USING(officeCode)
JOIN customers c
    ON
        e.employeeNumber = c.salesRepEmployeeNumber
JOIN
    orderdetails od
        USING(orderNumber)
WHERE officeCode IN
(
    SELECT
        productCode
    FROM
        offices
    JOIN
        orderdetails od
            USING(productCode)
    JOIN
        USING()
    JOIN
        USING()
    GROUP BY
        employeeNumber
    HAVING
        COUNT(*) < 20

## Select the Employee Number, First Name, Last Name, and Number of Customers for Employees Whose Customers Have an Average Credit Limit Over 15K

In [22]:
# Your code here
pd.read_sql('''
SELECT
    DISTINCT(employeeNumber),
    firstName,
    lastName,
    customerName
FROM
    employees e
JOIN
    customers c     
WHERE customerName IN
(
    SELECT 
        customerName
    FROM 
        customers
    WHERE
        creditLimit > 15000
)
    
GROUP BY
    employeeNumber
''', conn)

    employeeNumber firstName   lastName  number_of_customers
0             1002     Diane     Murphy                   97
1             1056      Mary  Patterson                   97
2             1076      Jeff   Firrelli                   97
3             1088   William  Patterson                   97
4             1102    Gerard     Bondur                   97
5             1143   Anthony        Bow                   97
6             1165    Leslie   Jennings                   97
7             1166    Leslie   Thompson                   97
8             1188     Julie   Firrelli                   97
9             1216     Steve  Patterson                   97
10            1286  Foon Yue      Tseng                   97
11            1323    George     Vanauf                   97
12            1337      Loui     Bondur                   97
13            1370    Gerard  Hernandez                   97
14            1401    Pamela   Castillo                   97
15            1501     Larry       Bott                   97
16            1504     Barry      Jones                   97
17            1611      Andy     Fixter                   97
18            1612     Peter      Marsh                   97
19            1619       Tom       King                   97
20            1621      Mami      Nishi                   97
21            1625   Yoshimi       Kato                   97
22            1702    Martin     Gerard                   97

In [25]:
pd.read_sql('''
SELECT
    DISTINCT(employeeNumber),
    COUNT(customerName),
    creditLimit
FROM
    employees
JOIN
    customers
WHERE
    creditLimit > 15000
GROUP BY
    customerName
''', conn)

    employeeNumber  COUNT(customerName)  creditLimit
0             1002                   23       136800
1             1002                   23        61100
2             1002                   23       113000
3             1002                   23       107800
4             1002                   23        21000
..             ...                  ...          ...
86            1002                   23       141300
87            1002                   23        76400
88            1002                   23        53100
89            1002                   23        55400
90            1002                   23        93900

[91 rows x 3 columns]

In [ ]:
FROM
    customers
JOIN
    orders
        USING(customerNumber)
JOIN
    orderdetails
        USING(orderNumber)
JOIN
    products
        USING(productCode)
GROUP BY
    productName
ORDER BY
    customer_amount ASC

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!